// ตัวดำเนินการทางตรรกศาสตร์

// [ Operator ] [ คำอธิบาย ]
// [ && ] [ AND ] -> และ
// [ || ] [ OR ] -> หรือ
// [ ! ] [ NOT ] 

// #1
// ซื้อมะม่วงและเงาะหรือไม่ ? => กลับบ้านได้ ( True )

// a = ซื้อมะม่วงหรือป่าว and b = ซื้อเงาะหรือป่าว ?

// a = true && b = true => a && b => กลับบ้านได้ (true)

// #2
//ซื้อมะม่วงหรือเงาะหรือไม่ ? => กลับบ้านได้ ( True )

// a = ซื้อมะม่วงหรือป่าว or b = ซื้อเงาะหรือป่าว ?

// a = true || b = false => a || b => กลับบ้านได้ (true)

//#3 ตัดเกรดคะแนนของนักเรียน
// 70 - 80 => A
// 50 - 60 => B
// < 49 => F

// let Score = 80;

// console.log(Score >= 70 && Score <=80,"A")
// console.log(Score >= 50 && Score <=60,"B")
// console.log(Score <= 49 , "F")