// =============================================================

// ตัวดำเนินการเปรียบเทียบ

// ชนิดข้อมูล Boolean 

// [Operator] - [คำอธิบาย]
// [ == ] - [ เท่ากับ ]
// [ != ] - [ ไม่เท่ากับ ]
// [ > ] - [ มากกว่า ]
// [ < ] - [ น้อยกว่า ]
// [ >= ] - [ มากกว่าเท่ากับ ]
// [ <= ] - [ น้อยกว่าเท่ากับ ]

// let a = 5 , b = 10 
// let check = true;

// console.log("เท่ากับหรือไม่",a == b)
// console.log("ไม่เท่ากับหรือไม่",a != b)
// console.log("A มากกว่า B หรือไม่", a > b)
// console.log("A น้อยกว่า B หรือไม่", a < b)
// console.log("A มากกว่าหรือเท่ากับ B หรือไม่", a >= b)
// console.log("A น้อยกว่าหรือเท่ากับ B หรือไม่", a <= b)

// console.log(!check) // เปลี่ยนค่าให้ตรงกันข้าม


// =============================================================

// ตัวดำเนืนการเพิ่มค่า - ลดค่า

// [Operator] - [ รูปแบบการเขียน ] - [คำอธิบาย] 
// ++ ( Prefix )       ++a        เพิ่มค่าให้ A ก่อน 1 ค่าแล้วนำไปใช้
// ++ ( Postfix )      a++         นำค่าปัจจุบันใน A ไปใช้ก่อนแล้วค่อยเพิ่มค่า
// -- ( Prefix )      --b         ลดค่าให้ b ก่อน 1 ค่าแล้วนำไปใช้
// -- ( Postfix )      b--         นำค่าปัจจุบันใน b ไปใช้ก่อนแล้วค่อยลดค่า

// let a = 5 , b = 10;

// // เพิ่มค่า Prefix 
// console.log("เพิ่มค่า Prefix")
// console.log("ค่าเริ่มต้น",a);
// console.log("ค่า Prefix",++a); // เพิ่มค่าบรรทัดนี้เลย
// console.log("ค่าปัจจุบัน",a);

// // เพิ่มค่า Postfix

// a = 5; // รีค่าใหม่

// console.log("เพิ่มค่า Postfix")
// console.log("ค่าเริ่มต้น",a);
// console.log("ค่า Postfix",a++); // เพิ่มค่าทีหลัง
// console.log("ค่าปัจจุบัน",a);

// // ลดค่าแบบ prefix
// console.log("ลดค่า Prefix")
// console.log("ค่าเริ่มต้น", b)
// console.log("ค่า Prefix",--b)
// console.log("ค่าปัจจุบัน", b)

// b = 10; // รีค่าใหม่

// // ลดค่าแบบ Postfix
// console.log("ลดค่าแบบ Prefix")
// console.log("ค่าเริ่มต้น", b)
// console.log("ค่า Postfix" , b--)
// console.log("ค่าปัจจุบัน" , b)

// ***********************************************************