// *****************************************

// [ Assignment ] [ รูปแบบการเขียน ] [ ความหมาย ]
//      +=          x+=y        x=x+y
//      -=          x-=y        x=x-y
//      *=          x*=y        x=x*y
//      /=          x/=y        x=x/y
//      %=          x%=y        x=x%y

// //EX.
// let x = 10 , y = 20;

// console.log("ก่อน = ",x)
// // x=x+y // or 
// x+=y
// console.log("หลัง = ",x)

// *****************************************

// ลำดับความสำคัญของตัวดำเนินการ

// [ ลำดับที่ ] [ เครื่องหมาย ] [ ลำดับการทำงาน ]

//  1           ()          
//  2           ++ , --                         ซ้ายไปขวา
//  3           * , / , %                       ซ้ายไปขวา
//  4           + , -                           ซ้ายไปขวา
//  5           < , <= , > , >=                 ซ้ายไปขวา
//  6           == , !=                         ซ้ายไปขวา            
//  7           &&                              ซ้ายไปขวา    
//  8           ||                              ซ้ายไปขวา
//  9           = , += , -= , *= , /= , %=      ขวาไปซ้าย

// // EX. 5+8*9
// console.log(5+8*9) // ผลลัพจะได้ 77 
// console.log((5+8)*9)

// // EX . 10-4+2
// console.log(10-4+2)

// // EX. 10-(2+1)
// console.log(10-(2+1))

// //EX 5*2-40/5  =2
// console.log(5*2-40/5)

// //EX 7+8/2+25  =36
// console.log(7+8/2+25)

// *****************************************