// *****************************************

// โครงสร้างการควบคุม

// 1 แบบลำดับ (Sequence) ( แบบลำดับที่ ซ้ายไปขวา ) ( เรียนแล้ว )
// 2 แบบมีเงื่อนไข (Condition)
// 3 แบบทำซำ้ (Loop)

// *****************************************

// แบบมีเงื่อนไข (Condition)

// if statement
/*

if(เงื่อนไข){
    คำสั่งเมื่อเงื่อนไขเป็นจริง;
}

*/

// *****************************************
// EX1 
// let age = 10;
// let result = (age >= 15);

// if(result){
//     console.log("คำนำหน้าเป็นนายหรือนางสาวแล้วนะจ้ะ")
// }
// else{
//     console.log("คำนำหน้าเป็นเด็กชายหรือเด็กหญิงนะจ้ะ")

// }
// *****************************************
// EX2
// let Money = 1000;
// let Pay_mom = 500;

// if(Money>Pay_mom){
//     console.log("จำนวนเงินในบัญชี", Money)
//     console.log("ดำเนินการโอนให้แม่" , Pay_mom)
//     Money = Money-Pay_mom
//     console.log("ยอดคงเหลือ", Money)
// }
// *****************************************

/*

if(เงื่อนไข){
    คำสั่งเมื่อเงื่อนไขเป็นจริง;
}
else{
    คำสั่งเมื่อเงื่อนไขเป็นเท็จ;
}

*/

// *****************************************

// EX2
// let Money = 200;
// let Pay_mom = 500;

// if(Money>Pay_mom){
//     console.log("จำนวนเงินในบัญชี", Money)
//     console.log("ดำเนินการโอนให้แม่" , Pay_mom)
//     Money = Money-Pay_mom
//     console.log("ยอดคงเหลือ", Money)
// }else{
//     console.log("ยอดเงินในบัญชีของคุณไม่พอสำหรับการโอนเงิน")
//     console.log("ยอดเงินในบัญชีของคุณมี = " ,Money)
//     console.log("จำนวนในการถอน = ", Pay_mom)
// }

// *****************************************

// if แบบหลายกรณี  เช็คทุกๆเงื่อนไข ควรใช้อย่างระวัง 
// ใช้แบบนี้ผลลัพธ์ จะได้ เกรดหลายๆตัวเพราะเข้าทุก if

// let Score = prompt();

// /*
// มากกว่า 40 => D    
// มากกว่า 50 => C
// มากกว่า 60 => B
// มากกว่า 70 => A
// */

// if(Score>70){
//     console.log("เกรด A")
// }
// if(Score>60){
//     console.log("เกรด B")
// }
// if(Score>50){
//     console.log("เกรด C")
// }
// if(Score>40){
//     console.log("เกรด D")
// }else{
//     console.log("คุณสอบตก")
// }

// *****************************************
// if แบบหลายกรณี  ใช้แบบนี้ผลลัพธ์ จะได้ เกรดแบบเดียว

// let Score = prompt();

// /*
// มากกว่า 40 => D    
// มากกว่า 50 => C
// มากกว่า 60 => B
// มากกว่า 70 => A
// */

// if(Score>=70){
//     console.log("เกรด A")
// }else if(Score>=60){
//     console.log("เกรด B")
// }else if(Score>=50){
//     console.log("เกรด C")
// }else if(Score>=40){
//     console.log("เกรด D")
// }else{
//     console.log("ตกกจ้า")
// }

// *****************************************

// ****** if..else แบบลดรูป

// ตัวแปร = (เงื่อนไข)?คำสั่งเมือเงื่อนไขเป็นจริง: คำสั่งเมื่อเงื่อนไขเป็นเท็จ;

// if(เงื่อนไข){
//     คำสั่งเมื่อเงื่อนไขเป็นจริง;
// }
// else{
//     คำสั่งเมื่อเงื่อนไขเป็นเท็จ;
// }

// *****************************************

//      ****** EX1 (รูปแบบทั่วไป)

// let Score = 40; // เต็ม 100
// let pass; // ค่าว่าง

// if(Score>50){
//     pass = "ผ่านเกรณ"
// }else{
//     pass = "ไม่ผ่านเกรณ"
// }

// console.log(pass)

// *****************************************
//      ****** EX1 ( รูปแบบ ลดรูป )

// let Score = prompt(); // เต็ม 100
// let pass; // ค่าว่าง

// pass = Score>=50 ? "ผ่านเกรณ" : "ไม่ผ่านเกรณ" ;

// console.log(pass)

// *****************************************

// ****** กา่รเขียน if ซ้อน if ******

/*
    if(เงื่อนไขที่ 1){
        if(เงื่อนไขที่ 2){
            คำสั่งเมื่อเงื่อนไขที่ 2 เป็นจริง;
        }
    }
*/

// let age = prompt("โปรดระบุอายุระหว่าง 1-15");
// // let age = 11;

// if(age<=15){
//     if(age==15){
//         console.log("ม.3")
//     }else if(age==14){
//         console.log("ม.2")
//     }else if(age==13){
//         console.log("ม.1")
//     }else{
//         console.log("ประถมศึกษา")
//     }
// }else{
//     console.log("มอปลาย","ปริญญา")
// }

// *****************************************